app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("user_id", "sighting_id", "created_at", "updated_at", "content") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 25], ["sighting_id", 4], ["created_at", "2020-09-01 12:42:16.382030"], ["updated_at", "2020-09-01 12:42:16.382030"], ["content", "can't believe this happened!"]]
---
    def create
    @comment = Comment.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_params
    @comment = Comment.find(params[:id])