app/controllers/api/v1/organisms_controller.rb

SELECT "organisms".* FROM "organisms"
---
    def index
    @organisms = Organism.all

INSERT INTO "organisms" ("common_name", "scientific_name", "image", "created_at", "updated_at", "category") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
    @organism = Organism.create(organism_params)

SELECT "organisms".* FROM "organisms" WHERE "organisms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_params
    @organism = Organism.find(params[:id])