app/controllers/api/v1/sightings_controller.rb

    def index
    @sightings = Sighting.all
---
SELECT "sightings".* FROM "sightings"

    def create
    @sighting = Sighting.create(sighting_params)
---
INSERT INTO "sightings" ("user_id", "organism_id", "location", "lat", "lng", "habitat", "weather", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def update
    @sighting.update(sighting_params)
---
UPDATE "sightings" SET "organism_id" = $1, "location" = $2, "updated_at" = $3 WHERE "sightings"."id" = $4  [["organism_id", 6], ["location", "Next to the MUDDY ditch behind the playground"], ["updated_at", "2020-08-31 16:51:35.502214"], ["id", 1]]

    def destroy
    sightingId = @sighting.id
    @sighting.destroy
---
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 7]]

    def set_params
    @sighting = Sighting.find(params[:id])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]