app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "username", "password_digest", "pic", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
    @user = User.create(user_params)